// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// for (let i=20; i <= 30; i=i+0.5) {
//     console.log(i)
// }
// 2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// for(let i = 10; i <= 110; i+= 10)
//     console.log(i, i * 27)
// 3.Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// let n = 100;
//
// nextPrime:
//     for (let i = 2; i <= n; i++) {
//         for (let j = 2; j < i; j++) {
//             if (i % j === 0) continue nextPrime;
//         }
//
//         alert( i );
//     }
// 4.Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// function getPrimes(num){
//     const seive = [];
//     const prime = [];
//     for(let i = 2; i <=num; i++){
//         if(!seive[i]){
//             prime.push(i);
//             for (let j = i*i; j<=num; j+=i){
//                 seive[j] = true;
//             }
//         }
//     }
// return prime;
// }
// console.log(getPrimes(100))
//5.Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
// let number = parseInt(prompt("enter number"));
//
// if (number % 3 === 0 && number ) {
//     document.write("Число можно получить ");
// }   else {
//     document.write("Число нельзя получить");


